grevaillot/svd_tools/headers/STM32F413/dfsdm1.h
#define DFSDM1_CH0CFGR1_SITP_SHIFT		0
#define DFSDM1_CH0CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm1_ch0cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch0cfgr2 CH0CFGR2 channel configuration y register
@{*/


#define DFSDM1_CH0CFGR2_OFFSET_SHIFT		8
#define DFSDM1_CH0CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_ch0cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CH0CFGR2_DTRBS_SHIFT		3
#define DFSDM1_CH0CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_ch0cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch0awscdr CH0AWSCDR analog watchdog and short-circuit detector register
@{*/


#define DFSDM1_CH0AWSCDR_AWFORD_SHIFT		22
#define DFSDM1_CH0AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm1_ch0awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_CH0AWSCDR_AWFOSR_SHIFT		16
#define DFSDM1_CH0AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_ch0awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_CH0AWSCDR_BKSCD_SHIFT		12
#define DFSDM1_CH0AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_ch0awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM1_CH0AWSCDR_SCDT_SHIFT		0
#define DFSDM1_CH0AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm1_ch0awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch0wdatr CH0WDATR channel watchdog filter data register
@{*/


#define DFSDM1_CH0WDATR_WDATA_SHIFT		0
#define DFSDM1_CH0WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm1_ch0wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch0datinr CH0DATINR channel data input register
@{*/


#define DFSDM1_CH0DATINR_INDAT1_SHIFT		16
#define DFSDM1_CH0DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm1_ch0datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM1_CH0DATINR_INDAT0_SHIFT		0
#define DFSDM1_CH0DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm1_ch0datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch1cfgr1 CH1CFGR1 CHCFG1R1
@{*/


#define DFSDM1_CH1CFGR1_DATPACK_SHIFT		14
#define DFSDM1_CH1CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm1_ch1cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM1_CH1CFGR1_DATMPX_SHIFT		12
#define DFSDM1_CH1CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm1_ch1cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM1_CH1CFGR1_CHINSEL CHINSEL **/
#define DFSDM1_CH1CFGR1_CHINSEL		(1 << 8)
/** DFSDM1_CH1CFGR1_CHEN CHEN **/
#define DFSDM1_CH1CFGR1_CHEN		(1 << 7)
/** DFSDM1_CH1CFGR1_CKABEN CKABEN **/
#define DFSDM1_CH1CFGR1_CKABEN		(1 << 6)
/** DFSDM1_CH1CFGR1_SCDEN SCDEN **/
#define DFSDM1_CH1CFGR1_SCDEN		(1 << 5)

#define DFSDM1_CH1CFGR1_SPICKSEL_SHIFT		2
#define DFSDM1_CH1CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm1_ch1cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM1_CH1CFGR1_SITP_SHIFT		0
#define DFSDM1_CH1CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm1_ch1cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch1cfgr2 CH1CFGR2 CHCFG1R2
@{*/


#define DFSDM1_CH1CFGR2_OFFSET_SHIFT		8
#define DFSDM1_CH1CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_ch1cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CH1CFGR2_DTRBS_SHIFT		3
#define DFSDM1_CH1CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_ch1cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch1awscdr CH1AWSCDR AWSCD1R
@{*/


#define DFSDM1_CH1AWSCDR_AWFORD_SHIFT		22
#define DFSDM1_CH1AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm1_ch1awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_CH1AWSCDR_AWFOSR_SHIFT		16
#define DFSDM1_CH1AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_ch1awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_CH1AWSCDR_BKSCD_SHIFT		12
#define DFSDM1_CH1AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_ch1awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM1_CH1AWSCDR_SCDT_SHIFT		0
#define DFSDM1_CH1AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm1_ch1awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch1wdatr CH1WDATR CHWDAT1R
@{*/


#define DFSDM1_CH1WDATR_WDATA_SHIFT		0
#define DFSDM1_CH1WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm1_ch1wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch1datinr CH1DATINR CHDATIN1R
@{*/


#define DFSDM1_CH1DATINR_INDAT1_SHIFT		16
#define DFSDM1_CH1DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm1_ch1datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM1_CH1DATINR_INDAT0_SHIFT		0
#define DFSDM1_CH1DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm1_ch1datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch2cfgr1 CH2CFGR1 CHCFG2R1
@{*/


#define DFSDM1_CH2CFGR1_DATPACK_SHIFT		14
#define DFSDM1_CH2CFGR1_DATPACK_MASK		0x03
/** @defgroup dfsdm1_ch2cfgr1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM1_CH2CFGR1_DATMPX_SHIFT		12
#define DFSDM1_CH2CFGR1_DATMPX_MASK		0x03
/** @defgroup dfsdm1_ch2cfgr1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM1_CH2CFGR1_CHINSEL CHINSEL **/
#define DFSDM1_CH2CFGR1_CHINSEL		(1 << 8)
/** DFSDM1_CH2CFGR1_CHEN CHEN **/
#define DFSDM1_CH2CFGR1_CHEN		(1 << 7)
/** DFSDM1_CH2CFGR1_CKABEN CKABEN **/
#define DFSDM1_CH2CFGR1_CKABEN		(1 << 6)
/** DFSDM1_CH2CFGR1_SCDEN SCDEN **/
#define DFSDM1_CH2CFGR1_SCDEN		(1 << 5)

#define DFSDM1_CH2CFGR1_SPICKSEL_SHIFT		2
#define DFSDM1_CH2CFGR1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm1_ch2cfgr1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM1_CH2CFGR1_SITP_SHIFT		0
#define DFSDM1_CH2CFGR1_SITP_MASK		0x03
/** @defgroup dfsdm1_ch2cfgr1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch2cfgr2 CH2CFGR2 CHCFG2R2
@{*/


#define DFSDM1_CH2CFGR2_OFFSET_SHIFT		8
#define DFSDM1_CH2CFGR2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm1_ch2cfgr2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM1_CH2CFGR2_DTRBS_SHIFT		3
#define DFSDM1_CH2CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_ch2cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch2awscdr CH2AWSCDR AWSCD2R
@{*/


#define DFSDM1_CH2AWSCDR_AWFORD_SHIFT		22
#define DFSDM1_CH2AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm1_ch2awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_CH2AWSCDR_AWFOSR_SHIFT		16
#define DFSDM1_CH2AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_ch2awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_CH2AWSCDR_BKSCD_SHIFT		12
#define DFSDM1_CH2AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_ch2awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


