grevaillot/svd_tools/headers/STM32F413/dfsdm1.h
#define DFSDM1_CH7CFGR2_DTRBS_SHIFT		3
#define DFSDM1_CH7CFGR2_DTRBS_MASK		0x1f
/** @defgroup dfsdm1_ch7cfgr2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch7awscdr CH7AWSCDR AWSCD7R
@{*/


#define DFSDM1_CH7AWSCDR_AWFORD_SHIFT		22
#define DFSDM1_CH7AWSCDR_AWFORD_MASK		0x03
/** @defgroup dfsdm1_ch7awscdr_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM1_CH7AWSCDR_AWFOSR_SHIFT		16
#define DFSDM1_CH7AWSCDR_AWFOSR_MASK		0x1f
/** @defgroup dfsdm1_ch7awscdr_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM1_CH7AWSCDR_BKSCD_SHIFT		12
#define DFSDM1_CH7AWSCDR_BKSCD_MASK		0x0f
/** @defgroup dfsdm1_ch7awscdr_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM1_CH7AWSCDR_SCDT_SHIFT		0
#define DFSDM1_CH7AWSCDR_SCDT_MASK		0xff
/** @defgroup dfsdm1_ch7awscdr_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch7wdatr CH7WDATR CHWDAT7R
@{*/


#define DFSDM1_CH7WDATR_WDATA_SHIFT		0
#define DFSDM1_CH7WDATR_WDATA_MASK		0xffff
/** @defgroup dfsdm1_ch7wdatr_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_ch7datinr CH7DATINR CHDATIN7R
@{*/


#define DFSDM1_CH7DATINR_INDAT1_SHIFT		16
#define DFSDM1_CH7DATINR_INDAT1_MASK		0xffff
/** @defgroup dfsdm1_ch7datinr_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM1_CH7DATINR_INDAT0_SHIFT		0
#define DFSDM1_CH7DATINR_INDAT0_MASK		0xffff
/** @defgroup dfsdm1_ch7datinr_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_flt0cr1 FLT0CR1 control register 1
@{*/

/** DFSDM1_FLT0CR1_AWFSEL Analog watchdog fast mode select **/
#define DFSDM1_FLT0CR1_AWFSEL		(1 << 30)
/** DFSDM1_FLT0CR1_FAST Fast conversion mode selection for regular conversions **/
#define DFSDM1_FLT0CR1_FAST		(1 << 29)

#define DFSDM1_FLT0CR1_RCH_SHIFT		24
#define DFSDM1_FLT0CR1_RCH_MASK		0x07
/** @defgroup dfsdm1_flt0cr1_rch RCH Regular channel selection
@{*/
/**@}*/

/** DFSDM1_FLT0CR1_RDMAEN DMA channel enabled to read data for the regular conversion **/
#define DFSDM1_FLT0CR1_RDMAEN		(1 << 21)
/** DFSDM1_FLT0CR1_RSYNC Launch regular conversion synchronously with DFSDM0 **/
#define DFSDM1_FLT0CR1_RSYNC		(1 << 19)
/** DFSDM1_FLT0CR1_RCONT Continuous mode selection for regular conversions **/
#define DFSDM1_FLT0CR1_RCONT		(1 << 18)
/** DFSDM1_FLT0CR1_RSWSTART Software start of a conversion on the regular channel **/
#define DFSDM1_FLT0CR1_RSWSTART		(1 << 17)

#define DFSDM1_FLT0CR1_JEXTEN_SHIFT		13
#define DFSDM1_FLT0CR1_JEXTEN_MASK		0x03
/** @defgroup dfsdm1_flt0cr1_jexten JEXTEN Trigger enable and trigger edge selection for injected conversions
@{*/
/**@}*/


#define DFSDM1_FLT0CR1_JEXTSEL_SHIFT		8
#define DFSDM1_FLT0CR1_JEXTSEL_MASK		0x07
/** @defgroup dfsdm1_flt0cr1_jextsel JEXTSEL Trigger signal selection for launching injected conversions
@{*/
/**@}*/

/** DFSDM1_FLT0CR1_JDMAEN DMA channel enabled to read data for the injected channel group **/
#define DFSDM1_FLT0CR1_JDMAEN		(1 << 5)
/** DFSDM1_FLT0CR1_JSCAN Scanning conversion mode for injected conversions **/
#define DFSDM1_FLT0CR1_JSCAN		(1 << 4)
/** DFSDM1_FLT0CR1_JSYNC Launch an injected conversion synchronously with the DFSDM0 JSWSTART trigger **/
#define DFSDM1_FLT0CR1_JSYNC		(1 << 3)
/** DFSDM1_FLT0CR1_JSWSTART Start a conversion of the injected group of channels **/
#define DFSDM1_FLT0CR1_JSWSTART		(1 << 1)
/** DFSDM1_FLT0CR1_DFEN DFSDM enable **/
#define DFSDM1_FLT0CR1_DFEN		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_flt0cr2 FLT0CR2 control register 2
@{*/


#define DFSDM1_FLT0CR2_AWDCH_SHIFT		16
#define DFSDM1_FLT0CR2_AWDCH_MASK		0xff
/** @defgroup dfsdm1_flt0cr2_awdch AWDCH Analog watchdog channel selection
@{*/
/**@}*/


#define DFSDM1_FLT0CR2_EXCH_SHIFT		8
#define DFSDM1_FLT0CR2_EXCH_MASK		0xff
/** @defgroup dfsdm1_flt0cr2_exch EXCH Extremes detector channel selection
@{*/
/**@}*/

/** DFSDM1_FLT0CR2_CKABIE Clock absence interrupt enable **/
#define DFSDM1_FLT0CR2_CKABIE		(1 << 6)
/** DFSDM1_FLT0CR2_SCDIE Short-circuit detector interrupt enable **/
#define DFSDM1_FLT0CR2_SCDIE		(1 << 5)
/** DFSDM1_FLT0CR2_AWDIE Analog watchdog interrupt enable **/
#define DFSDM1_FLT0CR2_AWDIE		(1 << 4)
/** DFSDM1_FLT0CR2_ROVRIE Regular data overrun interrupt enable **/
#define DFSDM1_FLT0CR2_ROVRIE		(1 << 3)
/** DFSDM1_FLT0CR2_JOVRIE Injected data overrun interrupt enable **/
#define DFSDM1_FLT0CR2_JOVRIE		(1 << 2)
/** DFSDM1_FLT0CR2_REOCIE Regular end of conversion interrupt enable **/
#define DFSDM1_FLT0CR2_REOCIE		(1 << 1)
/** DFSDM1_FLT0CR2_JEOCIE Injected end of conversion interrupt enable **/
#define DFSDM1_FLT0CR2_JEOCIE		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_flt0isr FLT0ISR interrupt and status register
@{*/


#define DFSDM1_FLT0ISR_SCDF_SHIFT		24
#define DFSDM1_FLT0ISR_SCDF_MASK		0xff
/** @defgroup dfsdm1_flt0isr_scdf SCDF short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_FLT0ISR_CKABF_SHIFT		16
#define DFSDM1_FLT0ISR_CKABF_MASK		0xff
/** @defgroup dfsdm1_flt0isr_ckabf CKABF Clock absence flag
@{*/
/**@}*/

/** DFSDM1_FLT0ISR_RCIP Regular conversion in progress status **/
#define DFSDM1_FLT0ISR_RCIP		(1 << 14)
/** DFSDM1_FLT0ISR_JCIP Injected conversion in progress status **/
#define DFSDM1_FLT0ISR_JCIP		(1 << 13)
/** DFSDM1_FLT0ISR_AWDF Analog watchdog **/
#define DFSDM1_FLT0ISR_AWDF		(1 << 4)
/** DFSDM1_FLT0ISR_ROVRF Regular conversion overrun flag **/
#define DFSDM1_FLT0ISR_ROVRF		(1 << 3)
/** DFSDM1_FLT0ISR_JOVRF Injected conversion overrun flag **/
#define DFSDM1_FLT0ISR_JOVRF		(1 << 2)
/** DFSDM1_FLT0ISR_REOCF End of regular conversion flag **/
#define DFSDM1_FLT0ISR_REOCF		(1 << 1)
/** DFSDM1_FLT0ISR_JEOCF End of injected conversion flag **/
#define DFSDM1_FLT0ISR_JEOCF		(1 << 0)

/**@}*/

/** @defgroup dfsdm1_flt0icr FLT0ICR interrupt flag clear register
@{*/


#define DFSDM1_FLT0ICR_CLRSCDF_SHIFT		24
#define DFSDM1_FLT0ICR_CLRSCDF_MASK		0xff
/** @defgroup dfsdm1_flt0icr_clrscdf CLRSCDF Clear the short-circuit detector flag
@{*/
/**@}*/


#define DFSDM1_FLT0ICR_CLRCKABF_SHIFT		16
#define DFSDM1_FLT0ICR_CLRCKABF_MASK		0xff
/** @defgroup dfsdm1_flt0icr_clrckabf CLRCKABF Clear the clock absence flag
@{*/
/**@}*/

/** DFSDM1_FLT0ICR_CLRROVRF Clear the regular conversion overrun flag **/
#define DFSDM1_FLT0ICR_CLRROVRF		(1 << 3)
/** DFSDM1_FLT0ICR_CLRJOVRF Clear the injected conversion overrun flag **/
#define DFSDM1_FLT0ICR_CLRJOVRF		(1 << 2)

/**@}*/

/** @defgroup dfsdm1_flt0jchgr FLT0JCHGR injected channel group selection register
@{*/


#define DFSDM1_FLT0JCHGR_JCHG_SHIFT		0
#define DFSDM1_FLT0JCHGR_JCHG_MASK		0xff
/** @defgroup dfsdm1_flt0jchgr_jchg JCHG Injected channel group selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_flt0fcr FLT0FCR filter control register
@{*/


#define DFSDM1_FLT0FCR_FORD_SHIFT		29
#define DFSDM1_FLT0FCR_FORD_MASK		0x07
/** @defgroup dfsdm1_flt0fcr_ford FORD Sinc filter order
@{*/
/**@}*/


