grevaillot/svd_tools/headers/STM32F413/dfsdm1.h
#define DFSDM1_FLT3AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM1_FLT3AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm1_flt3awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM1_FLT3AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM1_FLT3AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm1_flt3awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_flt3exmax FLT3EXMAX Extremes detector maximum register
@{*/


#define DFSDM1_FLT3EXMAX_EXMAX_SHIFT		8
#define DFSDM1_FLT3EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm1_flt3exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM1_FLT3EXMAX_EXMAXCH_SHIFT		0
#define DFSDM1_FLT3EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm1_flt3exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_flt3exmin FLT3EXMIN Extremes detector minimum register
@{*/


#define DFSDM1_FLT3EXMIN_EXMIN_SHIFT		8
#define DFSDM1_FLT3EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm1_flt3exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM1_FLT3EXMIN_EXMINCH_SHIFT		0
#define DFSDM1_FLT3EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm1_flt3exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm1_flt3cnvtimr FLT3CNVTIMR conversion timer register
@{*/


#define DFSDM1_FLT3CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM1_FLT3CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm1_flt3cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/
